# BuiltInFailures.JoinElementsFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures Class
BuiltInFailures Class Members See Also
---
Failures about JoinElements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class JoinElementsFailures
```

Visual Basic
---
```text
Public NotInheritable Class JoinElementsFailures
```

Visual C++
---
```text
public ref class JoinElementsFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..JoinElementsFailures
# See Also
BuiltInFailures..::..JoinElementsFailures Members
Autodesk.Revit.DB Namespace